icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/m66.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		// 文件名
 * Author:			// 作者
 * Date:			// 日期
 * Description:		// 模块描述
 * Version:			// 版本信息
 * Function List:	// 主要函数及其功能
 *     1. -------
 * History:			// 历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/

#include <stdio.h>
#include <rtthread.h>
#include <rtdevice.h>
#include "stm32f4xx.h"
#include <board.h>
#include <finsh.h>

#include "jt808.h"
#include "jt808_param.h"
#include "jt808_sms.h"
#include "jt808_gps.h"
#include "camera.h"

#include "m66.h"
#include "hmi.h"

typedef rt_err_t ( *AT_RESP )( char *p, uint16_t len );

typedef struct
{
	char			*atcmd;
	enum RESP_TYPE	type;           /*判断是处理字符串比较,还是有响应函数*/
	AT_RESP			resp;
	char			*compare_str;   /*要比较的字符串*/
	uint16_t		timeout;
	uint16_t		retry;
}AT_CMD_RESP;

enum _sms_state {
	SMS_IDLE=0,
	SMS_WAIT_CMGR_DATA,
	SMS_WAIT_CMGR_OK,
	//SMS_WAIT_CMGD_OK,
	//SMS_WAIT_CMGS_GREATER,  /*等待发送的>*/
	//SMS_WAIT_CMGS_OK,       /*等待发送的>*/
};


enum _modem_style {
	MODEM_UNKNOWN=0,
	MODEM_M50,
	MODEM_M66,
	MODEM_M69,
};


enum _record_state {
	RD_IDLE=0,
	RD_RECORDING,
	RD_READING,
};

typedef enum{
	MODEM_RES_NONE=0,
	MODEM_RES_OK,
	MODEM_RES_ERROR,
}_MODEM_RES;


enum _sms_state sms_state = SMS_IDLE;

#define GSM_GPIO			GPIOC
#define GSM_TX_PIN			GPIO_Pin_10
#define GSM_TX_PIN_SOURCE	GPIO_PinSource10

#define GSM_RX_PIN			GPIO_Pin_11
#define GSM_RX_PIN_SOURCE	GPIO_PinSource11

//typedef void ( *URC_CB )( char *s, uint16_t len );

#define GSM_PWR_PORT	GPIOD
#define GSM_PWR_PIN		GPIO_Pin_13

#define GSM_TERMON_PORT GPIOD
#define GSM_TERMON_PIN	GPIO_Pin_12

#define GSM_RST_PORT	GPIOD
#define GSM_RST_PIN		GPIO_Pin_11

/*声明一个gsm设备*/
static struct rt_device dev_gsm;

/*声明一个uart设备指针,同gsm模块连接的串口  指向一个已经打开的串口 */
static struct rt_mailbox	mb_gsmrx;
#define MB_GSMRX_POOL_SIZE 32
static uint8_t				mb_gsmrx_pool[MB_GSMRX_POOL_SIZE];


/*
   AT命令发送使用的mailbox
   供 VOICE TTS SMS TTS使用
 */
#define MB_TTS_POOL_SIZE 32
static struct rt_mailbox	mb_tts;
static uint8_t				mb_tts_pool[MB_TTS_POOL_SIZE];

#define MB_AT_TX_POOL_SIZE 32
static struct rt_mailbox	mb_at_tx;
static uint8_t				mb_at_tx_pool[MB_AT_TX_POOL_SIZE];

/* 消息邮箱控制块*/
static struct rt_mailbox mb_sms;
#define MB_SMS_RX_POOL_SIZE 32
/* 消息邮箱中用到的放置消息的内存池*/
static uint8_t mb_sms_pool[MB_SMS_RX_POOL_SIZE];

/*gsm 命令交互使用的信号量*/

static struct rt_semaphore sem_at;

#define GSM_RX_SIZE 2048
static uint8_t		gsm_rx[GSM_RX_SIZE];
static uint16_t		gsm_rx_wr = 0;

static T_GSM_STATE	gsm_state = GSM_IDLE;
static uint16_t 	gprs_rx_len=0;


/*串口接收缓存区定义*/
#define UART4_RX_SIZE 512
static uint8_t	uart4_rxbuf[UART4_RX_SIZE];
static uint16_t uart4_rxbuf_wr = 0, uart4_rxbuf_rd = 0;

/*控制输出多少条信息*/
static uint32_t fgsm_rawdata_out = 0xfffffff;

/*最近一次收到串口数据的时刻,不使用sem作为超时判断*/
static uint32_t last_tick;

uint8_t	modem_no_sim	= 0;				///该值为非0表示没有插入SIM卡
static enum _modem_style	modem_style=0;			///模块类型，0表示未知，1表示为M66,2表示为M50。
static  uint8_t mobile_cops=0;				///移动运行商，0表示中国移动，1表示中国联通



static uint32_t 	record_time=0;			//单位为tick,该值为非0表示需要录音，并表示录音的时间长度
static char 		record_handle[32];		//M50模块打开的文件句柄
static uint8_t		record_save_ok=0;		//为非0表示录音保存OK
enum _record_state 	record_state = RD_IDLE;	//录音状态
uint8_t				ICCID[10];				//表示SIM卡的ICCID

uint8_t 			tel_state=0;


/*拨号登网的参数*/
struct _dial_param
{
	char	*apn;
	char	*user;
	char	*psw;
	uint8_t fconnect;
}				dial_param;

static uint8_t	sms_index;
STRUCT_GSM_PARAM gsm_param;


/***********************************************************
* Function:
* Description: uart4的中断服务函数
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void UART4_IRQHandler( void )
{
	rt_interrupt_enter( );
	if( USART_GetITStatus( UART4, USART_IT_RXNE ) != RESET )
	{
		uart4_rxbuf[uart4_rxbuf_wr++]	= USART_ReceiveData( UART4 );
		uart4_rxbuf_wr					%= UART4_RX_SIZE;
		USART_ClearITPendingBit( UART4, USART_IT_RXNE );
		last_tick = rt_tick_get( );
	}

/*
   if (USART_GetITStatus(UART4, USART_IT_TC) != RESET)
   {
   USART_ClearITPendingBit(UART4, USART_IT_TC);
   }
 */
	rt_interrupt_leave( );
}

/***********************************************************
* Function:
* Description: 将小于0x20的字符忽略掉。并在结尾添加0，转为
   可见的字符串。
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/


/***********************************************************
* Function:
* Description: 将小于0x20的字符忽略掉。只保留数字部分。
               并在结尾添加0，转为可见的字符串。
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static uint16_t strip_numstring( char *str )
{
	char		*psrc, *pdst;
	uint16_t	len = 0;
	psrc	= str;
	pdst	= str;
	while( *psrc )
	{
		if( ( *psrc >= '0' ) && ( *psrc <= '9' ) )
		{
			*pdst++ = *psrc;
			len++;
		}else
		{
			if( len )
			{
				break;
			}
		}
		psrc++;
	}
	*pdst = 0;
	return len;
}
//uint32_t m66_ipr=115200;
uint32_t m66_ipr=57600;

/***********************************************************
* Function:
* Description: 配置控电管脚，配置对应的串口设备uart4
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t m66_init( rt_device_t dev )
{
	GPIO_InitTypeDef	GPIO_InitStructure;
	USART_InitTypeDef	USART_InitStructure;
	NVIC_InitTypeDef	NVIC_InitStructure;

	RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOD, ENABLE );
	RCC_APB1PeriphClockCmd( RCC_APB1Periph_UART4, ENABLE );

	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;

	GPIO_InitStructure.GPIO_Pin = GSM_PWR_PIN;
	GPIO_Init( GSM_PWR_PORT, &GPIO_InitStructure );
	GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );

	GPIO_InitStructure.GPIO_Pin = GSM_TERMON_PIN;
	GPIO_Init( GSM_TERMON_PORT, &GPIO_InitStructure );
	GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );


