icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/m66.c
/*
   RESET在开机过程不需要做任何时序配合（和通常CPU 的 reset不同）。
   建议该管脚接OC输出的GPIO，开机时 OC 输出高阻。
 */
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType	= GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;

	GPIO_InitStructure.GPIO_Pin = GSM_RST_PIN;
	GPIO_Init( GSM_RST_PORT, &GPIO_InitStructure );
	GPIO_SetBits( GSM_RST_PORT, GSM_RST_PIN );

	GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_9;
	GPIO_Init( GPIOD, &GPIO_InitStructure );

/*uart4 管脚设置*/

	/* Configure USART Tx as alternate function  */
	GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin		= GSM_TX_PIN | GSM_RX_PIN;
	GPIO_Init( GSM_GPIO, &GPIO_InitStructure );

	GPIO_PinAFConfig( GSM_GPIO, GSM_TX_PIN_SOURCE, GPIO_AF_UART4 );
	GPIO_PinAFConfig( GSM_GPIO, GSM_RX_PIN_SOURCE, GPIO_AF_UART4 );

	NVIC_InitStructure.NVIC_IRQChannel						= UART4_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
	NVIC_Init( &NVIC_InitStructure );

	USART_InitStructure.USART_BaudRate				= m66_ipr;
	USART_InitStructure.USART_WordLength			= USART_WordLength_8b;
	USART_InitStructure.USART_StopBits				= USART_StopBits_1;
	USART_InitStructure.USART_Parity				= USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl	= USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode					= USART_Mode_Rx | USART_Mode_Tx;
	USART_Init( UART4, &USART_InitStructure );
	/* Enable USART */
	USART_Cmd( UART4, ENABLE );
	USART_ITConfig( UART4, USART_IT_RXNE, ENABLE );
	
	return RT_EOK;
}

void set_m66_ipr(u32 value)
{
 rt_device_t dev = RT_NULL;
 m66_ipr = value;
 m66_init(dev);
 gsmstate(GSM_POWEROFF);
}
FINSH_FUNCTION_EXPORT( set_m66_ipr, control set_m66_ipr );

/***********************************************************
* Function:	提供给其他thread调用，打开设备，超时判断
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t m66_open( rt_device_t dev, rt_uint16_t oflag )
{
	if( gsm_state == GSM_IDLE )
	{
		gsm_state = GSM_POWERON; //置位上电过程中
	}
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t m66_close( rt_device_t dev )
{
	gsm_state = GSM_POWEROFF; //置位断电过程中
	return RT_EOK;
}

/***********************************************************
* Function:m66_read
* Description:数据模式下读取数据
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_size_t m66_read( rt_device_t dev, rt_off_t pos, void* buff, rt_size_t count )
{
	return RT_EOK;
}

/* write one character to serial, must not trigger interrupt */
static void uart4_putc( const char c )
{
	USART_SendData( UART4, c );
	while( !( UART4->SR & USART_FLAG_TC ) )
	{
		;
	}
	UART4->DR = ( c & 0x1FF );
}

/***********************************************************
* Function:		m66_write
* Description:	数据模式下发送数据，要对数据进行封装
* Input:		const void* buff	要发送的原始数据
       rt_size_t count	要发送数据的长度
       rt_off_t pos		使用的socket编号
* Output:
* Return:
* Others:
***********************************************************/

static rt_size_t m66_write( rt_device_t dev, rt_off_t pos, const void* buff, rt_size_t count )
{
	rt_size_t	len = count;
	uint8_t		*p	= (uint8_t*)buff + pos;

	while( len )
	{
		USART_SendData( UART4, *p++ );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		len--;
	}
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t m66_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
	switch( cmd )
	{
		case CTL_STATUS:
			*( (int*)arg ) = gsm_state;
			break;
		case CTL_AT_CMD: //发送at命令,结果要返回
			break;
		case CTL_PPP:
			break;
		case CTL_SOCKET:
			break;
	}
	return RT_EOK;
}

#define RESP_PROCESS

/**/
_MODEM_RES resp_common_proc( char *p, uint16_t len )
{
	char *psrc = p;

	if( strncmp( psrc, "OK", 2 ) == 0 )
	{
		return MODEM_RES_OK;
	}
	
	if( strncmp( psrc, "ERROR", 5 ) == 0 )
	{
		return MODEM_RES_ERROR;
	}
	return MODEM_RES_NONE;
}



/**/
rt_err_t resp_strOK( char *p, uint16_t len )
{
	char *psrc = p;

	if( strstr( psrc, "OK" ) == RT_NULL )
	{
		return -RT_ERROR;
	}
	return RT_EOK;
}


/*
   相应ATI命令，根据该命令判断模块的类型M50或M66

 */
rt_err_t resp_ATI( char *p, uint16_t len )
{
	//rt_kprintf( "\ncimi len=%d  %02x %02x", len, *p, *( p + 1 ) );
	static char mobile[6];

	if( strstr( p, "Quectel_M50" ) != RT_NULL )
		{
		modem_style	= MODEM_M50;
		rt_kprintf("\n MODEM IS M50");
		return RT_EOK;
		}
	else if( strstr( p, "M66" ) != RT_NULL )
		{
		modem_style	= MODEM_M66;
		rt_kprintf("\n MODEM IS M66");
		return RT_EOK;
		}
	else if( strstr( p, "M69" ) != RT_NULL )
		{
		modem_style	= MODEM_M69;
		rt_kprintf("\n MODEM IS M69");
		return RT_EOK;
		}
	return RT_ERROR;
}



/*
   响应CREG或CGREG
   00017796 gsm_rx<+CREG: 0,3

   00018596 gsm_rx<+CREG: 0,1

   用
   i = sscanf( p, "%*[^:]:%d,%d", &n, &code );
   找有问题!(跟代码位置有关?)

 */
rt_err_t resp_CGREG( char *p, uint16_t len )
{
	char	* pfind;
	char	* psrc;
	char	c;
	psrc	= p;
	pfind	= strchr( psrc, ',' );
	if( pfind != RT_NULL )
	{
		c = *( pfind + 1 );
		if( ( c == '1' ) || ( c == '5' ) )
		{
			return RT_EOK;
		}
	}
	return RT_ERROR;
}


/*
"%TSIM 0":无sim卡
"OK"
"%TSIM 1":有sim卡
"OK"
 */
rt_err_t resp_TSIM_M66( char *p, uint16_t len )
{
	static uint8_t no_sim_counter = 0;
	if( strncmp( p, "%TSIM 0", 7 ) == 0 )    /*没有SIM卡*/
	{
		no_sim_counter++;
		
		if(no_sim_counter >= 6)
		{
			modem_no_sim = 1;
			return RT_EOK;
		}
	}
	
	if( strncmp( p, "%TSIM 1", 7 ) == 0 )    /*有SIM卡*/
	{
		no_sim_counter	= 0;
		modem_no_sim 	= 0;
		return RT_EOK;
	}
	return RT_ERROR;
}

