icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/m66.c
/*
   SIM卡的IMSI号码为4600 00783208249，
      460 00 18 23 20 86 42

   接口号数据字段的内容为IMSI号码的后12位
   其6个字节的内容为 0x00 0x07 0x83 0x20 0x82 0x49

 */
rt_err_t resp_CIMI( char *p, uint16_t len )
{
	//rt_kprintf( "\ncimi len=%d  %02x %02x", len, *p, *( p + 1 ) );
	static char mobile[6];
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	mobile[0]	= ( ( *( p + 3 ) - '0' ) << 4 ) | ( *( p + 4 ) - '0' );
	mobile[1]	= ( ( *( p + 5 ) - '0' ) << 4 ) | ( *( p + 6 ) - '0' );
	mobile[2]	= ( ( *( p + 7 ) - '0' ) << 4 ) | ( *( p + 8 ) - '0' );
	mobile[3]	= ( ( *( p + 9 ) - '0' ) << 4 ) | ( *( p + 10 ) - '0' );
	mobile[4]	= ( ( *( p + 11 ) - '0' ) << 4 ) | ( *( p + 12 ) - '0' );
	mobile[5]	= ( ( *( p + 13 ) - '0' ) << 4 ) | ( *( p + 14 ) - '0' );
	strcpy( gsm_param.imsi, p );

	return RT_EOK;
}


/*
   SIM卡的IMSI号码为4600 00783208249，
      460 00 18 23 20 86 42

   接口号数据字段的内容为IMSI号码的后12位
   其6个字节的内容为 0x00 0x07 0x83 0x20 0x82 0x49

 */
rt_err_t resp_CIMI_M50( char *p, uint16_t len )
{
	//rt_kprintf( "\ncimi len=%d  %02x %02x", len, *p, *( p + 1 ) );
	static char mobile[6];
	static uint8_t no_sim_counter = 0;
	if(MODEM_RES_ERROR == resp_common_proc(p, len))
	{
		no_sim_counter++;
		if(no_sim_counter >= 6)
		{
			modem_no_sim = 1;
			return RT_EOK;
		}
	}
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	mobile[0]	= ( ( *( p + 3 ) - '0' ) << 4 ) | ( *( p + 4 ) - '0' );
	mobile[1]	= ( ( *( p + 5 ) - '0' ) << 4 ) | ( *( p + 6 ) - '0' );
	mobile[2]	= ( ( *( p + 7 ) - '0' ) << 4 ) | ( *( p + 8 ) - '0' );
	mobile[3]	= ( ( *( p + 9 ) - '0' ) << 4 ) | ( *( p + 10 ) - '0' );
	mobile[4]	= ( ( *( p + 11 ) - '0' ) << 4 ) | ( *( p + 12 ) - '0' );
	mobile[5]	= ( ( *( p + 13 ) - '0' ) << 4 ) | ( *( p + 14 ) - '0' );
	strcpy( gsm_param.imsi, p );
	modem_no_sim = 0;
	no_sim_counter = 0;
	return RT_EOK;
}


/*
   SIM卡的ICCID号码为89860030020212620582
   接口号数据字段的内容为IMSI号码的后12位
   其6个字节的内容为 0x00 0x07 0x83 0x20 0x82 0x49

 */
rt_err_t resp_ICCID( char *p, uint16_t len )
{
	//rt_kprintf( "\ncimi len=%d  %02x %02x", len, *p, *( p + 1 ) );
	uint8_t	i;
	static uint8_t no_sim_counter = 0;
	if(MODEM_RES_ERROR == resp_common_proc(p, len))
	{
		no_sim_counter++;
		if(no_sim_counter >= 6)
		{
			modem_no_sim = 1;
			return RT_EOK;
		}
	}
	if( len < 20 )
	{
		return RT_ERROR;
	}

	for(i=0;i<20;i+=2)
		{
		ICCID[i/2]	= ( ( p[i] - '0' ) << 4 ) | (  p[i+1] - '0' );
		}
	modem_no_sim = 0;
	no_sim_counter = 0;
	return RT_EOK;
}


/*响应CGSN**/
rt_err_t resp_CGSN( char *p, uint16_t len )
{
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	strcpy( gsm_param.imsi, p );
	return RT_EOK;
}

/* +CSQ: 31, 99 */
rt_err_t resp_CSQ( char *p, uint16_t len )
{
	uint32_t i, n, code;
	//i = sscanf( p, "+CSQ%*[^:]:%d,%d", &n, &code );
	i = sscanf( p, "+CSQ:%d,%d", &n, &code );
	gsm_param.csq = 0;
	
	if( i != 2 )
	{
		return RT_ERROR;
	}
	if((n<99)&&(n>8))
	{
		gsm_param.csq = n;
		return RT_EOK;
	}
	else
	{
		return RT_ERROR;
	}
}

/*
   %ETCPIP:1,"10.24.44.142","0.0.0.0","0.0.0.0"
   只查找第一对IP,  LocalIP

 */
rt_err_t resp_ETCPIP( char *p, uint16_t len )
{
	uint8_t stage	= 0;
	char	*psrc	= p;
	char	*pdst	= gsm_param.ip;

	memset( gsm_param.ip, 0, 15 );
	while( 1 )
	{
		if( stage == 0 )
		{
			if( *psrc == '"' )
			{
				stage = 1;
			}
			psrc++;
		}else
		{
			if( *psrc == '"' )
			{
				break;
			}
			*pdst = *psrc;
			pdst++;
			psrc++;
		}
	}
	rt_kprintf( "\nip=%s", gsm_param.ip );
	return RT_EOK;
}

/*
   AT%DNSR="www.google.com"
   %DNSR:74.125.153.147
   OK
 */

rt_err_t resp_DNSR_M50( char *p, uint16_t len )
{
	char *psrc = p;
	unsigned char ip[4];
	if(sscanf(psrc,"%d.%d.%d.%d",ip[0],ip[1],ip[2],ip[3]) == 4)
		{
		memset( pcurr_socket->ip_addr, 0, 15 );
		memcpy( pcurr_socket->ip_addr, psrc, len );

		rt_kprintf( "\ndns ip=%s", pcurr_socket->ip_addr );
		return RT_EOK;
		}
	return RT_ERROR;
}

/*
   AT%DNSR="www.google.com"
   %DNSR:74.125.153.147
   OK
 */

rt_err_t resp_DNSR_M66( char *p, uint16_t len )
{
	char *psrc = p;

	if( strstr( psrc, "%DNSR:" ) == RT_NULL )
	{
		return RT_ERROR;
	}
	psrc = p;
	if( pcurr_socket != RT_NULL )
	{
		memset( pcurr_socket->ip_addr, 0, 15 );
		memcpy( pcurr_socket->ip_addr, psrc + 6, len - 6 );

		rt_kprintf( "\ndns ip=%s", pcurr_socket->ip_addr );
	}
	return RT_EOK;
}


rt_err_t resp_linking_M50( char *p, uint16_t len )
{
	char *psrc = p;
	char buf[64];
	sprintf( buf, "%d, CONNECT ", pcurr_socket->linkno);
	if( strncmp( p, buf, 11) == 0 )
	{
		if( strncmp( p+11, "FAIL", 4) == 0 )
			{
			return RT_ERROR;
			}
		if( strncmp( p+11, "OK", 2) == 0 )
			{
			return RT_EOK;
			}
	}
}


/**/
rt_err_t resp_IPOPENX( char *p, uint16_t len )
{
	char *psrc = p;
	if( strstr( psrc, "CONNECT" ) != RT_NULL )
	{
		return RT_EOK;
	}
	return RT_ERROR;
}

/**/
rt_err_t resp_DEBUG( char *p, uint16_t len )
{
	rt_kprintf( "\nresp_debug>%s", p );
	return RT_ERROR;
}



/*拨打电话回调函数**/
rt_err_t resp_TEL( char *p, uint16_t len )
{
	static uint8_t no_sim_counter = 0;
	if( strcmp( p, "NO DIALTONE" ) == 0 )    /*没有SIM卡*/
	{
		return RT_EOK;
	}
	else if( strcmp( p, "BUSY" ) == 0 )    /*没有SIM卡*/
	{
		return RT_EOK;
	}
	else if( strcmp( p, "NO CARRIER" ) == 0 )    /*没有SIM卡*/
	{
		return RT_EOK;
	}
	else if( strcmp( p, "OK" ) == 0 )    /*没有SIM卡*/
	{
		rt_kprintf("\n%d> tel ok!",rt_tick_get());
		return RT_EOK;
	}
	return RT_ERROR;
}





///////////////////////录音相关处理函数	START

rt_err_t resp_record_del_M50( char *p, uint16_t len )
{
	char *psrc = p;
	char buf[64];
	uint32_t temp_int;
	if(sscanf( p, "+CME ERROR:%d", &temp_int )==1)
	{
		if(temp_int == 4010)
			return RT_EOK;
	}
	if( strncmp( p, "OK", 2) == 0 )
	{
		rt_kprintf( "\n resp_record_del_OK!");
		return RT_EOK;
	}
	return RT_ERROR;
}



rt_err_t resp_recording_M50( char *p, uint16_t len )
{
	char *psrc = p;
	char buf[64];
	if( strncmp( p, "+QAUDRD: 0", 10) == 0 )
	{
		return RT_EOK;
	}
	if( strncmp( p, "+QAUDPIND:", 10) == 0 )
	{
		return RT_EOK;
	}
	return RT_ERROR;
}


rt_err_t resp_record_open_M50( char *p, uint16_t len )
{
	char *psrc = p;
	
	if( strncmp( p, "+QFOPEN:", 8) == 0 )
	{
		if(strlen(p+8)<sizeof(record_handle))
		{
			memset(record_handle,0,sizeof(record_handle));
			strcpy(record_handle,p+8);
			strtrim(record_handle,' ');
			return RT_EOK;
		}
	}
	return RT_ERROR;
}


rt_err_t resp_record_read_M50( char *p, uint16_t len )
{
	char *psrc = p;
	static uint32_t	infolen = 0;
	uint32_t		i,j;
	static uint8_t	buftemp[4096];
	static uint32_t	bufwr=0;
	TypeDF_PackageHead	pack_head;

	if(p == RT_NULL)
		{
		infolen	= 0;					///
		bufwr	= 64;					///长度预留包头部分
		memset(buftemp,0xFF,4096);		///将包头部分清空
		record_save_ok = 0;
		return RT_ERROR;
		}
	
	rt_kprintf("\n resp_record_read_M50=%d",len);
	if((infolen)&&(len == infolen))
	{
		rt_kprintf( "\n%d gsm<", rt_tick_get( ));
		printf_hex_data(psrc, infolen);
		for(i=0;i<len;i++)
			{
			buftemp[(bufwr++)%4096] = psrc[i];
			if(bufwr%4096 == 0)
				{
				Cam_Flash_SaveMediaData(bufwr-4096,buftemp,4096);
				memset(buftemp,0xFF,4096);
				}
			}
		
		if(len<1024)
			{
			Cam_Flash_SaveMediaData(bufwr/4096*4096,buftemp,bufwr%4096);
			goto FUNC_RECORD_END;
			}
		return RT_EOK;
	}
	else
	{
		infolen	= 0;
	}
	
