icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/m66.c
	if(sscanf( p, "CONNECT%d", &infolen )==1)
	{
		rt_kprintf("\n Read Media_2=%d; \n",infolen);
		if(infolen == 0)
			{
			goto FUNC_RECORD_END;
			}
		return RT_ERROR;
	}
	
	return RT_ERROR;

FUNC_RECORD_END:
	rt_kprintf("\n Save Mdeia!");
	pack_head.Channel_ID	= 1;
	pack_head.TiggerStyle	= 1;
	pack_head.Media_Format	= 5;
	pack_head.Media_Style	= 1;
	pack_head.Time			= mytime_now;
	pack_head.Head			= CAM_HEAD;
	pack_head.State			= 0xFF;
	pack_head.id			= DF_PicParam.Last.Data_ID + 1;
	pack_head.Len 			= bufwr;
	memcpy( (uint8_t*)&( pack_head.position ), (uint8_t*)&gps_baseinfo, 28 );
	Cam_Flash_SaveMediaData(0, (uint8_t*)&pack_head, sizeof(TypeDF_PackageHead));
	record_save_ok=1;

	rt_kprintf("\n Media:\n");
	for(i=0,j=0;;j++)
		{
		if(Cam_Flash_RdPic(buftemp,(uint16_t *)&i,pack_head.id,j)!=RT_EOK)
			{
			break;
			}
		
		printf_hex_data(buftemp, i);
		}
	rt_kprintf("\nEND\n");
	return RT_EOK;
}



/*
   获取设备网络运营商信息

 */
rt_err_t resp_COPS( char *p, uint16_t len )
{
	//rt_kprintf( "\ncimi len=%d  %02x %02x", len, *p, *( p + 1 ) );
	static char mobile[6];

	if( strstr( p, "CHINA UNICOM" ) != RT_NULL )		///中国联通
		{
		mobile_cops = 1;
		return RT_EOK;
		}
	else if( strstr( p, "CHINA MOBILE" ) != RT_NULL )	///中国移动
		{
		mobile_cops = 0;
		return RT_EOK;
		}
	else if( strncmp( p, "+COPS:" ,6) == 0 )			///其它网络都认为是中国移动
		{
		mobile_cops = 0;
		return RT_EOK;
		}
	return RT_ERROR;
}


///////////////////////录音相关处理函数	END


/*
   发送AT命令，并等待响应函数处理
   参照 code.google.com/p/gsm-playground的实现
 */

//rt_err_t gsm_send( AT_CMD_RESP* pat_cmd_resp )
rt_err_t gsm_send( char *atcmd,
                   RESP_FUNC respfunc,
                   char * compare_str,
                   uint8_t type,
                   uint32_t timeout,
                   uint8_t retry )

{
	rt_err_t		err;
	uint8_t			i;
	char			*pmsg;
	uint32_t		tick_start, tick_end;
	uint32_t		tm;
	__IO uint8_t	flag_wait;

	char			* pinfo;
	uint16_t		len;

	///2013.12.25 新增加的部分，目的是防止前面有漏处理的数据，不要影响当前要发送的命令的处理
	if(strlen(atcmd))
	{
		while( RT_EOK == rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pmsg, 1 ))
		{
			rt_free( pmsg );
		}
	}
	
	for( i = 0; i < retry; i++ )
	{
		tick_start	= rt_tick_get( );
		tick_end	= tick_start + timeout;
		tm			= timeout;
		flag_wait	= 1;
		if( strlen( atcmd ) )                                       /*要发送字符串*/
		{
			rt_kprintf( "\n%d gsm>%s", tick_start, atcmd );
			m66_write( &dev_gsm, 0, atcmd, strlen( atcmd ) );
		}
		if( type == RESP_TYPE_NONE )                                /*不等，只是光发送，严格上retry=1,即只发送一次*/
		{
			return RT_EOK;
		}
		while( flag_wait )
		{
			err = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pmsg, tm );
			if( err == RT_EOK )                                     /*没有超时,判断信息是否正确*/
			{
				len		= ( *pmsg << 8 ) | ( *( pmsg + 1 ) );
				pinfo	= pmsg + 2;

				if( type >= RESP_TYPE_STR )
				{
					if( strstr( pinfo, compare_str ) != RT_NULL )   /*找到了 todo:如果不是期望的字符串 如ERROR如何处理*/
					{
						rt_free( pmsg );
						if( type == RESP_TYPE_STR_WITHOK )
						{
							goto lbl_send_wait_ok;
						}
						return RT_EOK;
					}
					/*
					else if ( strncmp( pinfo, "ERROR", 5 ) == 0 )
					{
						flag_wait = 0;
					}
					*/
				}else if( respfunc( pinfo, len ) == RT_EOK )    /*找到了*/
				{
					rt_free( pmsg );                            /*释放*/
					if( type == RESP_TYPE_FUNC_WITHOK )
					{
						goto lbl_send_wait_ok;
					}
					return RT_EOK;
				}
				rt_free( pmsg );                                /*释放*/
				/*计算剩下的超时时间,由于其他任务执行的延时，会溢出,要判断*/
				if( rt_tick_get( ) < tick_end )                 /*还没有超时*/
				{
					tm = tick_end - rt_tick_get( );
				}else
				{
					flag_wait = 0;
				}
			}else /*已经超时*/
			{
				flag_wait = 0;
			}
		}
	}

	return ( -RT_ETIMEOUT );

lbl_send_wait_ok:
	pmsg	= RT_NULL;  /*重新开始等待*/
	err		= rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pmsg, tm );
	if( err == RT_EOK ) /*没有超时,判断信息是否正确*/
	{
		if( strstr( pmsg + 2, "OK" ) != RT_NULL )
		{
			rt_free( pmsg );
			return RT_EOK;
		}
	}
	rt_free( pmsg );
	return RT_ERROR;
}

/*
   判断一个字符串是不是表示ip的str
   如果由[0..9|.] 组成
   '.' 0x2e   '/' 0x2f   '0' 0x30  '9' 0x39   简化一下。不判断 '/'
   返回值
   0:表示域名的地址
   1:表示是IP地址

 */
static uint8_t is_ipaddr( char * str )
{
	char *p = str;
	while( *p != NULL )
	{
		if( ( *p > '9' ) || ( *p < '.' ) )
		{
			return 0;
		}
		p++;
	}
	return 1;
}

#define MODULE_PROCESS



/*gsm供电的处理纤程*/
static void rt_thread_gsm_power_on( void* parameter )
{
	int			i,at_num;
	
	const AT_CMD_RESP *p_at_init;
	
	const AT_CMD_RESP at_init[] =
	{
		{ "AT\r\n",		 	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 5  },
		{ "ATE0\r\n",		 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },
		{ "ATI\r\n",		 RESP_TYPE_FUNC, 		resp_ATI,	RT_NULL,		RT_TICK_PER_SECOND * 3, 3  },
		{ "ATV1\r\n",		 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 5, 3  },
		{ "AT+CGMR\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///
	};
	/*
	const AT_CMD_RESP at_init_m66[] =
	{
		{ "AT%TSIM\r\n",	 RESP_TYPE_FUNC_WITHOK,	resp_TSIM_M66,RT_NULL,		RT_TICK_PER_SECOND * 2, 8  },
		{ "AT+CMGF=0\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///短信模式0:PDU,1:TEXT
		{ "AT+CNMI=1,1\r\n", RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///短信是否直接发送给TE
		{ "AT+CPIN?\r\n",	 RESP_TYPE_STR_WITHOK,	RT_NULL,	"+CPIN: READY", RT_TICK_PER_SECOND * 2, 30 },	///查询PIN码
		{ "AT+CIMI\r\n",	 RESP_TYPE_FUNC_WITHOK, resp_CIMI,	RT_NULL,		RT_TICK_PER_SECOND * 2, 10 },	///查询CIMI
		{ "AT+QCCID\r\n",	 RESP_TYPE_FUNC,		resp_ICCID,RT_NULL,			RT_TICK_PER_SECOND * 2, 3  },		///这个是M66的命令
		{ "AT+CLIP=1\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 10 },
		{ "AT+CSQ\r\n",	 	 RESP_TYPE_FUNC_WITHOK,	resp_CSQ,	RT_NULL,		RT_TICK_PER_SECOND * 2, 30 },
		{ "AT+CREG?\r\n",	 RESP_TYPE_FUNC_WITHOK, resp_CGREG, RT_NULL,		RT_TICK_PER_SECOND * 2, 30 },
		{ "AT+COPS?\r\n",	 RESP_TYPE_FUNC_WITHOK,	resp_COPS,	RT_NULL,		RT_TICK_PER_SECOND * 2, 3  }
	};
	*/
	const AT_CMD_RESP at_init_m69[] =
	{
	#if 0 
		{ "AT+CLVL=6\r\n",   RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置喇叭音量为6,范围0~6
		{ "AT%SNFS=1\r\n",   RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置音频输出通道选择 第二路
		{ "AT%NFI=1,12,0,0\r\n",   RESP_TYPE_STR,	RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置音频输入通道 选择第 二路 
		{ "AT%NFO=1,6,0\r\n",	 RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///设置输出音量
		{ "AT%NFV=5\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///扬声器设置  --没有音频功放 没用
		{ "AT%NFW=1\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///扬声器设置  --没有音频功放 没用
		{ "AT%NFS=1\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///扬声器设置  --没有音频功放 没用
	#endif
		{ "AT+CLVL=6\r\n",   RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置喇叭音量为6,范围0~6
		{ "AT%SNFS=1\r\n",   RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置音频输出通道选择 第二路
		{ "AT%NFI=1,8,0,0\r\n",   RESP_TYPE_STR,	RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置音频输入通道 选择第 二路 
		{ "AT%NFO=1,6,0\r\n",	 RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///设置输出音量
		{ "AT%NFV=5\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///扬声器设置  --没有音频功放 没用
		{ "AT%NFW=2\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///扬声器设置  --没有音频功放 没用
		{ "AT%NFS=2\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///扬声器设置  --没有音频功放 没用
	
		//{ "AT%VLB=1\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///开启回波消除
		{ "AT+VGR=9\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 3  },	///通话最大音量
		{ "AT%TSIM\r\n",	 RESP_TYPE_FUNC_WITHOK,	resp_TSIM_M66,RT_NULL,		RT_TICK_PER_SECOND * 2, 8  },
		{ "AT+CMGF=0\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///短信模式0:PDU,1:TEXT
		{ "AT+CNMI=1,1\r\n", RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///短信是否直接发送给TE
		{ "AT+CPIN?\r\n",	 RESP_TYPE_STR_WITHOK,	RT_NULL,	"+CPIN: READY", RT_TICK_PER_SECOND * 2, 30 },	///查询PIN码
		{ "AT+CIMI\r\n",	 RESP_TYPE_FUNC_WITHOK, resp_CIMI,	RT_NULL,		RT_TICK_PER_SECOND * 2, 10 },	///查询CIMI
		//{ "AT+QCCID\r\n",	 RESP_TYPE_FUNC,		resp_ICCID,RT_NULL,		RT_TICK_PER_SECOND * 2, 3 },		///这个是M66的命令
		{ "AT+CLIP=1\r\n",	 RESP_TYPE_STR,			RT_NULL,	"OK",			RT_TICK_PER_SECOND * 2, 10 },
		{ "AT+CSQ\r\n",	 	 RESP_TYPE_FUNC_WITHOK,	resp_CSQ,	RT_NULL,		RT_TICK_PER_SECOND * 2, 30 },
		{ "AT+CREG?\r\n",	 RESP_TYPE_FUNC_WITHOK, resp_CGREG, RT_NULL,		RT_TICK_PER_SECOND * 2, 30 },
		{ "AT+COPS?\r\n",	 RESP_TYPE_FUNC_WITHOK,	resp_COPS,	RT_NULL,		RT_TICK_PER_SECOND * 2, 3  }
	};
	const AT_CMD_RESP at_init_m50[] =
	{
		{ "AT+QIMUX=1\r\n", 	RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///允许多路连接
		{ "AT+IPR=57600\r\n",	RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },
		{ "AT+QAUDCH=2\r\n",	RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置音频通道,范围:0,1,2
		{ "AT+CLVL=30\r\n", 	RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置喇叭音量为30,范围0~100
		{ "AT+CRSL=30\r\n", 	RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置媒体播放音量为30,范围0~100
		{ "AT+QMEDVL=30\r\n",	RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///设置铃音音量为30,范围0~100
		{ "AT+CIMI\r\n",		RESP_TYPE_FUNC,		resp_CIMI_M50,RT_NULL,		RT_TICK_PER_SECOND * 2, 10 },
		{ "AT+QCCID\r\n",		RESP_TYPE_FUNC,		resp_ICCID,	RT_NULL,		RT_TICK_PER_SECOND * 2, 3 },
		{ "AT+CSQ\r\n", 		RESP_TYPE_FUNC_WITHOK, resp_CSQ,	RT_NULL,	RT_TICK_PER_SECOND * 2, 30 },
		//{ "AT+CSQ\r\n", 		RESP_TYPE_STR, 		RT_NULL,	"ERROR",		RT_TICK_PER_SECOND * 2, 5 },
		{ "AT+CMGF=0\r\n",	 	RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///短信模式0:PDU,1:TEXT
		{ "AT+CSCS=\"GSM\"\r\n",RESP_TYPE_STR,		RT_NULL,	"OK",			RT_TICK_PER_SECOND * 3, 3  },	///短信模式0:PDU,1:TEXT
		{ "AT+COPS?\r\n",	 RESP_TYPE_FUNC_WITHOK,	resp_COPS,	RT_NULL,		RT_TICK_PER_SECOND * 2, 3  }
	};
	
	if(jt808_param.id_0xF00F == 0)
		return;
	sd_write_console("GSM模块POWER_ON!");
lbl_poweron_start:
	///先关掉电源
	GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
	GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
	///等待一小会放电
	rt_thread_delay( RT_TICK_PER_SECOND*3);
	///开电源然后等待500ms
	GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );
	rt_kprintf( "\n%d gsm_power_on>start", rt_tick_get( ) );
	rt_thread_delay( RT_TICK_PER_SECOND / 2 );
	///开PWRKEY管脚为低 然后等待2秒
	GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
	rt_thread_delay( RT_TICK_PER_SECOND * 3);
	modem_no_sim = 0;
	///先发送通用命令，检测模块类型
	for( i = 0; i < sizeof( at_init ) / sizeof( AT_CMD_RESP ); i++ )
	{
		if( gsm_send( at_init[i].atcmd, \
		              at_init[i].resp, \
		              at_init[i].compare_str, \
		              at_init[i].type, \
		              at_init[i].timeout, \
		              at_init[i].retry ) != RT_EOK )
		{
			/*todo 错误计数，通知显示*/
			rt_kprintf( "\n%d gsm_power_on>error index=%d", rt_tick_get( ), i );
			goto lbl_poweron_start;
		}
	}

	if(modem_style == MODEM_M66)
	{
		p_at_init 	= at_init_m69;
		at_num		= sizeof( at_init_m69) / sizeof( AT_CMD_RESP );
	}
	else if(modem_style == MODEM_M50)
	{
		p_at_init = at_init_m50;
		at_num		= sizeof( at_init_m50) / sizeof( AT_CMD_RESP );
	}
	else if(modem_style == MODEM_M69)
	{
		p_at_init = at_init_m69;
		at_num		= sizeof( at_init_m69) / sizeof( AT_CMD_RESP );
	}
	else
	{
		goto lbl_poweron_start;
	}
	for( i = 0; i < at_num; i++ )
	{
		if( gsm_send( p_at_init[i].atcmd, \
					  p_at_init[i].resp, \
					  p_at_init[i].compare_str, \
					  p_at_init[i].type, \
					  p_at_init[i].timeout, \
					  p_at_init[i].retry ) != RT_EOK )
		{
			/*todo 错误计数，通知显示*/
			rt_kprintf( "\n%d gsm_power_on>error index=%d", rt_tick_get( ), i );
			goto lbl_poweron_start;
		}
		if( modem_no_sim )
		{
			rt_kprintf("\n 无SIM卡");
			beep(2,2,3);
			break;
		}
	}

