icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/m66.c
		err = gsm_send( "AT+CGATT?\r\n", RT_NULL, "+CGATT: 1", RESP_TYPE_STR_WITHOK, RT_TICK_PER_SECOND * 2, 20 );
		if( err != RT_EOK )
		{
			goto lbl_gsm_gprs_end_err;
		}
		*/

		sprintf( buf, "AT+CGDCONT=1,\"IP\",\"%s\"\r\n", dial_param.apn );

		err = gsm_send( buf, RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 10, 2 );
		if( err != RT_EOK )
		{
			goto lbl_gsm_gprs_end_err;
		}

		err = gsm_send( "AT%IOMODE=1,2,1\r\n", RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 10, 1 );
		if( err != RT_EOK )
		{
			goto lbl_gsm_gprs_end_err;
		}

		if( ( strlen( dial_param.user ) == 0 ) && ( strlen( dial_param.psw ) == 0 ) )
		{
			err = gsm_send( "AT%ETCPIP\r\n", RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 151, 1 );
		}else
		{
			sprintf( buf, "AT%ETCPIP=\"%s\",\"%s\"\r\n", dial_param.user, dial_param.psw );
			err = gsm_send( buf, RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 151, 1 );
		}
		if( err != RT_EOK )
		{
			goto lbl_gsm_gprs_end_err;
		}

		err = gsm_send( "AT%ETCPIP?\r\n", resp_ETCPIP, RT_NULL, RESP_TYPE_FUNC_WITHOK, RT_TICK_PER_SECOND * 10, 1 );
		if( err != RT_EOK )
		{
			goto lbl_gsm_gprs_end_err;
		}

		gsm_state = GSM_TCPIP;
		goto lbl_gsm_gprs_end;
	}
lbl_gsm_gprs_end_err:
	rt_kprintf( "\n登网错误" );
	gsm_state = GSM_POWEROFF;
lbl_gsm_gprs_end:
	rt_kprintf( "\n%08d gsm_gprs>gsm_state=%d", rt_tick_get( ), gsm_state );
}


/*控制登网，还是断网*/
static void rt_thread_gsm_gprs( void* parameter )
{
	if((modem_no_sim)||(device_control.off_link_counter))
		return;
	if(modem_style == MODEM_M50)
	{
		rt_thread_gsm_gprs_M50(parameter);
	}
	else
	{
		rt_thread_gsm_gprs_M69(parameter);
	}
}


/*关于链路维护,只维护一个，多链路由上层处理*/
static void rt_thread_gsm_socket_M50( void* parameter )
{
	char		buf[128];
	char		rx_buf[32];
	rt_err_t	err;
	AT_CMD_RESP at_cmd_resp;

	if( pcurr_socket == RT_NULL )
	{
		return;
	}
	if( pcurr_socket->state == CONNECT_CLOSING ) /*挂断连接*/
	{
		sprintf( buf, "AT+QICLOSE=%d\r\n", pcurr_socket->linkno );
		sprintf( rx_buf, "%d, CLOSE OK", pcurr_socket->linkno );
		err = gsm_send( buf, RT_NULL, rx_buf, RESP_TYPE_STR, RT_TICK_PER_SECOND * 10, 1 );
		if( err != RT_EOK )
		{
			pcurr_socket->state		= CONNECT_ERROR;
			pcurr_socket->err_no	= 0x80 | CONNECT_CLOSING;
		}else
		{
			pcurr_socket->state = CONNECT_CLOSED;
		}
		goto lbl_gsm_socket_end;
	}

	if( pcurr_socket->state == CONNECT_PEER )       /*建立连接*/
	{
		if( is_ipaddr( pcurr_socket->ipstr ) == 0 ) /*不是IP地址，执行DNS*/
		{
			sprintf( buf, "AT+QIDNSGIP=\"%s\"\r\n", pcurr_socket->ipstr );
			err = gsm_send( buf, resp_DNSR_M50, RT_NULL, RESP_TYPE_FUNC, RT_TICK_PER_SECOND * 30, 1 );
			if( err != RT_EOK )
			{
				pcurr_socket->state		= CONNECT_ERROR;
				pcurr_socket->err_no	= 0x80 | CONNECT_PEER;
				goto lbl_gsm_socket_end;
			}
		}else
		{
			strcpy( pcurr_socket->ip_addr, pcurr_socket->ipstr );
		}
		if( pcurr_socket->type == 'u' )
		{
			sprintf( buf, "AT+QIOPEN=%d,\"UDP\",\"%s\",\"%d\"\r\n", pcurr_socket->linkno, pcurr_socket->ip_addr, pcurr_socket->port );
		}else
		{
			sprintf( buf, "AT+QIOPEN=%d,\"TCP\",\"%s\",\"%d\"\r\n", pcurr_socket->linkno, pcurr_socket->ip_addr, pcurr_socket->port );
		}
		
		err = gsm_send( buf, resp_linking_M50, RT_NULL, RESP_TYPE_FUNC, RT_TICK_PER_SECOND * 3, 10 );
		if( err != RT_EOK )
		{
			pcurr_socket->state		= CONNECT_ERROR;
			pcurr_socket->err_no	= 0x80 | CONNECT_PEER;
		}else
		{
			pcurr_socket->state = CONNECTED;
		}
	}

lbl_gsm_socket_end:
	gsm_state = GSM_TCPIP; /*socket过程处理完成，结果在state中*/
	rt_kprintf( "\n%d gsm_socket>socket_state=%d", rt_tick_get( ), pcurr_socket->state );
}


/*关于链路维护,只维护一个，多链路由上层处理*/
static void rt_thread_gsm_socket_M66( void* parameter )
{
	char		buf[128];
	rt_err_t	err;
	AT_CMD_RESP at_cmd_resp;

	if( pcurr_socket == RT_NULL )
	{
		return;
	}
	if( pcurr_socket->state == CONNECT_CLOSING ) /*挂断连接*/
	{
		sprintf( buf, "AT%%IPCLOSE=%d\r\n", pcurr_socket->linkno );
		err = gsm_send( buf, RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 10, 1 );
		if( err != RT_EOK )
		{
			pcurr_socket->state		= CONNECT_ERROR;
			pcurr_socket->err_no	= 0x80 | CONNECT_CLOSING;
		}else
		{
			pcurr_socket->state = CONNECT_CLOSED;
		}
		goto lbl_gsm_socket_end;
	}

	if( pcurr_socket->state == CONNECT_PEER )       /*建立连接*/
	{
		if( is_ipaddr( pcurr_socket->ipstr ) == 0 ) /*不是IP地址，执行DNS*/
		{
			sprintf( buf, "AT%%DNSR=\"%s\"\r\n", pcurr_socket->ipstr );
			err = gsm_send( buf, resp_DNSR_M66, RT_NULL, RESP_TYPE_FUNC_WITHOK, RT_TICK_PER_SECOND * 30, 1 );
			if( err != RT_EOK )
			{
				pcurr_socket->state		= CONNECT_ERROR;
				pcurr_socket->err_no	= 0x80 | CONNECT_PEER;
				goto lbl_gsm_socket_end;
			}
		}else
		{
			strcpy( pcurr_socket->ip_addr, pcurr_socket->ipstr );
		}
		if( pcurr_socket->type == 'u' )
		{
			sprintf( buf, "AT%%IPOPENX=%d,\"UDP\",\"%s\",%d\r\n", pcurr_socket->linkno, pcurr_socket->ip_addr, pcurr_socket->port );
		}else
		{
			sprintf( buf, "AT%%IPOPENX=%d,\"TCP\",\"%s\",%d\r\n", pcurr_socket->linkno, pcurr_socket->ip_addr, pcurr_socket->port );
		}
		err = gsm_send( buf, RT_NULL, "CONNECT", RESP_TYPE_STR, RT_TICK_PER_SECOND * 10, 1 );
		if( err != RT_EOK )
		{
			pcurr_socket->state		= CONNECT_ERROR;
			pcurr_socket->err_no	= 0x80 | CONNECT_PEER;
		}else
		{
			pcurr_socket->state = CONNECTED;
		}
	}

lbl_gsm_socket_end:
	gsm_state = GSM_TCPIP; /*socket过程处理完成，结果在state中*/
	rt_kprintf( "\n%d gsm_socket>socket_state=%d", rt_tick_get( ), pcurr_socket->state );
}


/*控制登网，还是断网*/
static void rt_thread_gsm_socket( void* parameter )
{
	if((modem_no_sim)||(device_control.off_link_counter))
		return;
	if(modem_style == MODEM_M50)
	{
		rt_thread_gsm_socket_M50(parameter);
	}
	else
	{
		rt_thread_gsm_socket_M66(parameter);
	}
}


/*调试信息控制输出*/
rt_err_t dbgmsg( uint32_t i )
{
	if( i == 0 )
	{
		rt_kprintf( "\ndebmsg=%d", fgsm_rawdata_out );
	} else
	{
		fgsm_rawdata_out = i;
	}
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( dbgmsg, dbgmsg count );

#define SOCKET_PROCESS


/***********************************************************
* Function: 直接发送信息，要做808转义和m66转义
* Description:
* Input:   原始信息
* Output:
* Return:
* Others:
***********************************************************/
rt_size_t socket_write_M50( uint8_t linkno, uint8_t* buff, rt_size_t count )
{
	rt_size_t	len = count;
	rt_size_t	i;
	uint8_t		*p	= (uint8_t*)buff;
	uint8_t		c;

