icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/m66.c
	rt_err_t	ret;

	uint8_t		fcs = 0;

	char		buf_start[20];
	char		buf_end[4] = { '"', 0x0d, 0x0a, 0x0 };
	char		buf_send[2]={0x7E,0x00};
	char		buf_send1[2]={0x7D,0x01};
	char		buf_send2[2]={0x7D,0x02};

	uint8_t		tbl[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };

	for(i=0;i<len;i++)
	{
		fcs ^= buff[i]; /*计算fcs*/
		if( buff[i] == 0x7E )
		{
			count++;
		}else if( buff[i] == 0x7D )
		{
			count++;
		}
	}
	if( fcs == 0x7E )
	{
		count++;
	}else if( fcs == 0x7D )
	{
		count++;
	}
	count+=3;		///包头包尾的7E和校验，共3字节
	
	sprintf( buf_start, "AT+QISEND=%d,%d\r\n", linkno,count);
	ret = gsm_send( buf_start, RT_NULL, ">", RESP_TYPE_STR, RT_TICK_PER_SECOND, 1 );
	//m66_write( &dev_gsm, 0, buf_start, strlen( buf_start ) );
	//rt_kprintf( "%s", buf_start );
	//rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	m66_write( &dev_gsm, 0, buf_send, 1 );
	printf_hex_data(buf_send, 1);
	while( len )
	{
		c	= *p++;
		//fcs ^= c; /*计算fcs*/
		if( c == 0x7E )
		{
			m66_write( &dev_gsm, 0, buf_send2, 2 );
			printf_hex_data(buf_send2, 2);
		}else if( c == 0x7D )
		{
			m66_write( &dev_gsm, 0, buf_send1, 2 );
			printf_hex_data(buf_send1, 2);
		}else
		{
			m66_write( &dev_gsm, 0, &c, 1 );
			printf_hex_data(&c, 1);
		}
		len--;
	}
/*再发送fcs*/
	if( fcs == 0x7E )
	{
		m66_write( &dev_gsm, 0, buf_send2, 2 );
		printf_hex_data(buf_send2, 2);
	}else if( fcs == 0x7D )
	{
		m66_write( &dev_gsm, 0, buf_send1, 2 );
		printf_hex_data(buf_send1, 2);
	}else
	{
		m66_write( &dev_gsm, 0, &fcs, 1 );
		printf_hex_data(&fcs, 1);
	}
/*再发送7E尾*/
	m66_write( &dev_gsm, 0, buf_send, 1 );
	printf_hex_data(buf_send, 1);
	rt_kprintf( "\r\n");

	ret = gsm_send( "", RT_NULL, "SEND OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 10, 1 );
	return ret;
}


/***********************************************************
* Function: 直接发送信息，要做808转义和m66转义
* Description:
* Input:   原始信息
* Output:
* Return:
* Others:
***********************************************************/
rt_size_t socket_write_M66( uint8_t linkno, uint8_t* buff, rt_size_t count )
{
	rt_size_t	len = count;
	uint8_t		*p	= (uint8_t*)buff;
	uint8_t		c;

	rt_err_t	ret;

	uint8_t		fcs = 0;

	char		buf_start[20];
	char		buf_end[4] = { '"', 0x0d, 0x0a, 0x0 };

	uint8_t		tbl[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };

	sprintf( buf_start, "AT%%IPSENDX=%d,\"", linkno );
	m66_write( &dev_gsm, 0, buf_start, strlen( buf_start ) );
	rt_kprintf( "%s", buf_start );
	m66_write( &dev_gsm, 0, "7E", 2 );
	rt_kprintf( "%s", "7E" );
	while( len )
	{
		c	= *p++;
		fcs ^= c; /*计算fcs*/
		if( c == 0x7E )
		{
			m66_write( &dev_gsm, 0, "7D02", 4 );
			rt_kprintf( "%s", "7D02" );
		}else if( c == 0x7D )
		{
			m66_write( &dev_gsm, 0, "7D01", 4 );
			rt_kprintf( "%s", "7D01" );
		}else
		{
			USART_SendData( UART4, tbl[c >> 4] );
			while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
			{
			}
			rt_kprintf( "%c", tbl[c >> 4] );
			USART_SendData( UART4, tbl[c & 0x0f] );
			while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
			{
			}
			rt_kprintf( "%c", tbl[c & 0x0f] );
		}
		len--;
	}
/*再发送fcs*/
	if( fcs == 0x7E )
	{
		m66_write( &dev_gsm, 0, "7D02", 4 );
		rt_kprintf( "%s", "7D02" );
	}else if( fcs == 0x7D )
	{
		m66_write( &dev_gsm, 0, "7D01", 4 );
		rt_kprintf( "%s", "7D01" );
	}else
	{
		USART_SendData( UART4, tbl[fcs >> 4] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[fcs >> 4] );
		USART_SendData( UART4, tbl[fcs & 0x0f] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[fcs & 0x0f] );
	}
/*再发送7E尾*/
	m66_write( &dev_gsm, 0, "7E", 2 );
	rt_kprintf( "%s", "7E" );

	m66_write( &dev_gsm, 0, buf_end, 3 );
	rt_kprintf( "%s", buf_end );

	ret = gsm_send( "", RT_NULL, "%IPSENDX:", RESP_TYPE_STR, RT_TICK_PER_SECOND * 10, 1 );
	return ret;
}


/*控制登网，还是断网*/
rt_size_t socket_write( uint8_t linkno, uint8_t* buff, rt_size_t count )
{
	if(modem_style == MODEM_M50)
	{
		socket_write_M50(linkno,buff,count);
	}
	else
	{
		socket_write_M66(linkno,buff,count);
	}
}


/*控制gsm状态 0 查询*/
T_GSM_STATE gsmstate( T_GSM_STATE cmd )
{
	uint8_t i;
	if( cmd != GSM_STATE_GET )
	{
		gsm_state = cmd;
	}
	if(( cmd == GSM_POWEROFF  )||(cmd == GSM_POWERON)||(cmd == GSM_IDLE))
	{
		socket_para_init();
	}
	return gsm_state;
}

FINSH_FUNCTION_EXPORT( gsmstate, control gsm state );

/*控制登录到gprs*/
void ctl_gprs( char* apn, char* user, char*psw, uint8_t fdial )
{
	if(mobile_cops == 0)
	{
		dial_param.apn		= "CMNET";
	}
	else
	{
		dial_param.apn		= "UNINET";
	}
	
	dial_param.user		= user;
	dial_param.psw		= psw;
	dial_param.fconnect = fdial;
	gsm_state			= GSM_GPRS;
}

#define TTS_PROCESS



/*
   tts语音播报的处理

   是通过
   %TTS: 0 判断tts状态(怀疑并不是每次都有输出)
   还是AT%TTS? 查询状态
 */
void tts_proc_M50( void )
{
	rt_size_t	len;
	uint8_t		*pinfo, *p;
	uint8_t		c;
	T_GSM_STATE oldstate;

	char		buf[20];
	char		tbl[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };

	
/*是否有信息要播报*/
	if( rt_mb_recv( &mb_tts, (rt_uint32_t*)&pinfo, 0 ) != RT_EOK )
	{
		return;
	}

	oldstate	= gsm_state;
	gsm_state	= GSM_AT_SEND;
	GPIO_ResetBits( GPIOD, GPIO_Pin_9 ); /*开功放*/
	rt_kprintf( "\n%d>", rt_tick_get( ) );
	sprintf( buf, "AT+QTTS=2,\"" );
	rt_kprintf( "%s", buf );
	rt_device_write( &dev_gsm, 0, buf, strlen( buf ) );
	len = ( *pinfo << 8 ) | ( *( pinfo + 1 ) );
	p	= pinfo + 2;
	while( len-- )
	{
		c		= *p++;
		rt_device_write( &dev_gsm, 0, &c, 1 );
		rt_kprintf( "%c", c );
	}
	sprintf( buf, "\",4\r\n" );
	rt_device_write( &dev_gsm, 0, buf, strlen(buf) );
	rt_kprintf( "%s", buf );
/*不判断，在gsmrx_cb中处理 %TTS: 0*/
	rt_free( pinfo );
	if( gsm_send( "", RT_NULL, "+QTTS:0", RESP_TYPE_STR, RT_TICK_PER_SECOND * 50, 1 ) == RT_EOK )
	{
		rt_kprintf( "\n播报结束" );
	}
	GPIO_SetBits( GPIOD, GPIO_Pin_9 ); /*关功放*/
	gsm_state = oldstate;
}


/*
   tts语音播报的处理

   是通过
   %TTS: 0 判断tts状态(怀疑并不是每次都有输出)
   还是AT%TTS? 查询状态
 */
void tts_proc_M66( void )
{
	rt_size_t	len;
	uint8_t		*pinfo, *p;
	uint8_t		c;
	T_GSM_STATE oldstate;

	char		buf[20];
	char		tbl[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };


