icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/m66.c
/*是否有信息要播报*/
	if( rt_mb_recv( &mb_tts, (rt_uint32_t*)&pinfo, 0 ) != RT_EOK )
	{
		return;
	}

	oldstate	= gsm_state;
	gsm_state	= GSM_AT_SEND;
	GPIO_ResetBits( GPIOD, GPIO_Pin_9 ); /*开功放*/
	rt_kprintf( "\n%d>", rt_tick_get( ) );
	sprintf( buf, "AT%%TTS=2,3,6,\"" );
	rt_device_write( &dev_gsm, 0, buf, strlen( buf ) );
	rt_kprintf( "%s", buf );
	len = ( *pinfo << 8 ) | ( *( pinfo + 1 ) );
	p	= pinfo + 2;
	while( len-- )
	{
		c		= *p++;
		buf[0]	= tbl[c >> 4];
		buf[1]	= tbl[c & 0x0f];
		rt_device_write( &dev_gsm, 0, buf, 2 );
		rt_kprintf( "%c%c", buf[0], buf[1] );
	}
	buf[0]	= '"';
	buf[1]	= 0x0d;
	buf[2]	= 0x0a;
	buf[3]	= 0;
	rt_device_write( &dev_gsm, 0, buf, 3 );
	rt_kprintf( "%s", buf );
/*不判断，在gsmrx_cb中处理 %TTS: 0*/
	rt_free( pinfo );
	if( gsm_send( "", RT_NULL, "%TTS: 0", RESP_TYPE_STR, RT_TICK_PER_SECOND * 50, 1 ) == RT_EOK )
	{
		rt_kprintf( "\n播报结束" );
	}
	GPIO_SetBits( GPIOD, GPIO_Pin_9 ); /*关功放*/
	gsm_state = oldstate;
}


/*
   tts语音播报的处理

   是通过
   %TTS: 0 判断tts状态(怀疑并不是每次都有输出)
   还是AT%TTS? 查询状态
 */
void tts_proc( void )
{
	///如果模块没有开机或者已经关机则直接退出
	if(( gsm_state < GSM_AT)||(gsm_state == GSM_POWEROFF))
	{
		return;
	}
	if(modem_style == MODEM_M50)
	{
		tts_proc_M50();
	}
	else
	{
		tts_proc_M66();
	}
}

/*
   收到tts信息并发送
   返回0:OK
    1:分配RAM错误
 */
rt_size_t tts_write( char* info, uint16_t len )
{
	uint8_t *pmsg;
	/*直接发送到Mailbox中,内部处理*/
	pmsg = rt_malloc( len + 2 );
	if( pmsg != RT_NULL )
	{
		*pmsg			= len >> 8;
		*( pmsg + 1 )	= len & 0xff;
		memcpy( pmsg + 2, info, len );
		rt_mb_send( &mb_tts, (rt_uint32_t)pmsg );
		return 0;
	}
	return 1;
}

/**/
rt_err_t tts( char *s )
{
	tts_write( s, strlen( s ) );
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( tts, tts send );



uint8_t record_rx_M50( char *pinfo, uint16_t size )
{
	int			st, index, count;
	char		buf[40];                                        /*160个OCT需要320byte*/
	uint32_t	tick = rt_tick_get( );
	uint32_t	infolen;

	if(record_state != RD_RECORDING)
		{
		return 0;
		}
	if(sscanf( pinfo, "CONNECT%d", &infolen )==1)
	{
		gprs_rx_len = infolen;
		rt_kprintf("\n Read Media=%d; \n",infolen);
	}
	return 0;
}


void record_proc_M50(void)
{
	rt_err_t		err;
	char			*pmsg;
	uint32_t   		i;
	char			buf[64];
	static uint32_t	sktart_tick = 0;
	
 	if(record_time == 0)
 	{
 		return;
 	}
	///如果模块没有开机或者已经关机则直接退出
	if(( gsm_state < GSM_AT)||(gsm_state == GSM_POWEROFF))
	{
		return;
	}

	gsm_send( "", RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND / 5, 1 );
	sprintf(buf,"AT+QFDEL=\"aaa.amr\"\r\n");
	err = gsm_send( buf, resp_record_del_M50, RT_NULL, RESP_TYPE_FUNC, RT_TICK_PER_SECOND * 3, 3 );
	if( err != RT_EOK )
	{
		record_time = 0;
		return;
	}
	
	///开始录音
	err = gsm_send( "AT+QAUDRD=1,\"aaa.amr\",3\r\n", RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 3, 3 );
	if( err != RT_EOK )
	{
		record_time = 0;
		return;
	}
	sktart_tick = rt_tick_get();
	///等待录音结束
	while(rt_tick_get()-sktart_tick < record_time * RT_TICK_PER_SECOND)
	{
		err = gsm_send( "AT+QAUDRD?\r\n", resp_recording_M50, RT_NULL, RESP_TYPE_FUNC, RT_TICK_PER_SECOND * 3, 1 );
		if( err == RT_EOK )
		{
			break;
		}
	}
	record_time = 0;
	///录音结束命令
	err = gsm_send( "AT+QAUDRD=0,\"aaa.amr\",3\r\n", RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 3, 6 );
	if( err != RT_EOK )
	{
		return;
	}
	///打开文件
	err = gsm_send( "AT+QFOPEN=\"aaa.amr\"\r\n", resp_record_open_M50, RT_NULL, RESP_TYPE_FUNC, RT_TICK_PER_SECOND * 3, 3 );
	if( err != RT_EOK )
	{
		return;
	}
	resp_record_read_M50(RT_NULL,0);
	sprintf(buf,"AT+QFREAD=%s,1024\r\n",record_handle);
	
	for(i=0;i<32;i++)
	{
		record_state = RD_RECORDING;
		err = gsm_send( buf, resp_record_read_M50, RT_NULL, RESP_TYPE_FUNC, RT_TICK_PER_SECOND * 3, 2 );
		if( err != RT_EOK )
		{
			break;
		}
		if(record_save_ok)
		{
			break;
		}
	}
	record_state = RD_IDLE;
	sprintf(buf,"AT+QFCLOSE=%s\r\n",record_handle);
	err = gsm_send( buf, RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 3, 3 );
	if( err != RT_EOK )
	{
		return;
	}
}


void record(uint32_t time)
{
 record_time = time;
 rt_kprintf("\n record=%ds",time);
}
FINSH_FUNCTION_EXPORT( record, record send );




#define AT_CMD_PROCESS


/*
   通常的AT命令，发出去交由系统处理，例如语音播报
   对于短信操作需要确认，尤其是多个短息连续到来时
   at命令处理，收到OK或超时退出
 */
void at_cmd_proc( void )
{
	rt_err_t	ret;
	uint8_t		*pinfo, *p;
	T_GSM_STATE oldstate;
	static uint32_t tick = 0;

	/*是否有信息要发送*/
	if( rt_mb_recv( &mb_at_tx, (rt_uint32_t*)&pinfo, 0 ) != RT_EOK )
	{
		return;
	}
	oldstate	= gsm_state;
	gsm_state	= GSM_AT_SEND;
	p			= pinfo + 2;
	ret			= gsm_send( (char*)p, RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 3, 1 );
	//ret = gsm_send( (char*)p, RT_NULL, "OK", RESP_TYPE_NONE, RT_TICK_PER_SECOND , 1 );
	rt_kprintf( "\nat_tx=%d", ret );
	rt_free( pinfo );
	if(gsm_state == GSM_AT_SEND)
		gsm_state = oldstate;
}

/*
   发送AT命令
   如何保证不干扰,其他的执行，传入等待的时间

 */
rt_size_t at( char *sinfo )
{
	char		*pmsg;
	uint16_t	count;
	
	for(count=0;count<strlen(sinfo);count++)
		{
		if(sinfo[count]=='\'')
			{
			sinfo[count] = '\"';
			}
		}

	count = strlen( sinfo );
	/*直接发送到Mailbox中,内部处理*/
	pmsg = rt_malloc( count + 3 );
	if( pmsg != RT_NULL )
	{
		count					= sprintf( pmsg + 2, "%s\r\n", sinfo );
		pmsg[0]					= count >> 8;
		pmsg[1]					= count & 0xff;
		*( pmsg + count + 2 )	= 0;
		rt_mb_send( &mb_at_tx, (rt_uint32_t)pmsg );
		return 0;
	}
	return 1;
}

FINSH_FUNCTION_EXPORT( at, write gsm );

#define SMS_PROCESS


/* +CSQ: 31, 99 */
rt_err_t resp_SMS_RX( char *p, uint16_t len )
{
	uint32_t i;
	for(i=0;i<len;i++)
		{
		if(((p[i]>='0')&&(p[i]<='9'))||((p[i]>='A')&&(p[i]<='F')))
			{
			continue;
			}
		else
			{
			rt_kprintf("\n resp_SMS_RX ERROR=%d",i);
			return RT_ERROR;
			}
		}
	jt808_sms_rx( p, len );
	return RT_EOK;
}


/*
   0:没有短信处理内容 非零值 有后续的处理

   4381 gsm<+CMTI: "SM",4
   4381 gsm<+CMTI: "SM",5
   4381 gsm>AT+CMGR=5


   4386 gsm<+CMTI: "SM",6
   4386 gsm>AT+CMGR=6
 */
uint8_t sms_rx( char *pinfo, uint16_t size )
{
	int			st, index, count;
	char		buf[40];                                        /*160个OCT需要320byte*/
	uint32_t	tick = rt_tick_get( );

