icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/m66.c
/*主动接收中心发来的信息*/
	if( strncmp( pinfo, "+CMTI: \"SM\",", 12 ) == 0 )           /*SM中满的时候，会存到ME中，如何读*/
	{
		if( sscanf( pinfo + 12, "%d", &index ) )
		{
			rt_mb_send( &mb_sms, index );                       /*通知要读短信*/
			return 1;
		}
	}
	
	#if 0
	else if( strncmp( pinfo, "+CMGR: ", 7 ) == 0 )             /*+CMGR: 0,156,有可能是串口读的短信*/
	{
		if( sscanf( pinfo + 7, "%d,%d", &st, &count ) == 2 )    /*得到信息的长度*/
		{
			sms_state = SMS_WAIT_CMGR_DATA;
			return 1;                                           /*直接返回，等待下一包*/
		}
	}else if( strncmp( pinfo, "+CMT:", 5 ) == 0 )               /*没有主动弹出的短信*/
	{
	}

	switch( sms_state )
	{
		case SMS_WAIT_CMGR_DATA:                                /*收到短信数据*/
			jt808_sms_rx( pinfo, size );                        /*解析数据*/
			sms_state = SMS_WAIT_CMGR_OK;
			break;
		case SMS_WAIT_CMGR_OK:
			if( strncmp( pinfo, "OK", 2 ) == 0 )                /*读完了信息,删除*/
			{
				sprintf( buf, "AT+CMGD=%d\r\n", sms_index );
				gsm_send( buf, RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND, 1 );
				sms_state = SMS_IDLE;
			}
			break;
	}
	#endif


/*
   if( tick - sms_tick > RT_TICK_PER_SECOND * 10 )
   {
   rt_kprintf( "\n靠,超时了" );
   sms_state = SMS_IDLE;
   }
 */
	return sms_state;
}

/*发送短信息,包含接收方,SMSC,7bit编码后的信息*/
void sms_tx( char* info, uint8_t tp_len )
{
	uint8_t len = strlen( info );
	char	*p;
	p = rt_malloc( len + 2 );
	if( p != RT_NULL )
	{
		p[0] = tp_len; /*tp_len AT+CMGS时需要*/
		strcpy( p + 1, info );
		rt_mb_send( &mb_sms, (uint32_t)p );
	}
}

/*
   增加这个函数主要是中心有多个消息过来时候，如果处理不及时，会乱
   使用mailbox进行排队处理读取或删除短信
 */
void sms_proc( void )
{
	uint32_t	value;
	uint32_t	j;
	char		*sms_send_str;
	char		buf[40];
	rt_err_t	ret;
	uint16_t	len;
	static uint32_t	sms_delay_tick = 0;

	T_GSM_STATE oldstate;

	if(rt_tick_get() < sms_delay_tick)
		return;

	sms_delay_tick	= 0;

	if( sms_state != SMS_IDLE )
	{
		return;
	}
	/*检查是否出于AT命令就绪的状态,可以进行短信操作*/
	///如果模块没有开机或者已经关机则直接退出
	if(( gsm_state < GSM_AT)||(gsm_state == GSM_POWEROFF))
	{
		return;
	}
	
	if( rt_mb_recv( &mb_sms, &value, 0 ) != RT_EOK ) /*收到短信操作*/
	{
		return;
	}
	oldstate	= gsm_state;
	gsm_state	= GSM_AT_SEND;

	if( value < 0xFF )
	{
		sprintf( buf, "AT+CMGR=%d\r\n", value );
		sms_index	= value;
		ret	= gsm_send( buf, RT_NULL, "+CMGR:", RESP_TYPE_STR, RT_TICK_PER_SECOND*3, 3 );
		if( ret == RT_EOK )
		{
			ret	= gsm_send( "", resp_SMS_RX, RT_NULL, RESP_TYPE_FUNC_WITHOK, RT_TICK_PER_SECOND * 6, 1 );
		}
		
		sprintf( buf, "AT+CMGD=%d\r\n", sms_index );
		gsm_send( buf, RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND*3, 3 );
		sms_state = SMS_IDLE;
		if(modem_style == MODEM_M50)		///M50的模块删除后不能立即发送数据，否则会容易发送不成功，等待一小会就OK
			sms_delay_tick = rt_tick_get() + RT_TICK_PER_SECOND;		
	}else                                   /*发送信息*/
	{
		sms_send_str= (char*)value;
		len			= sms_send_str[0];          /*tp_len*/
		sprintf( buf, "AT+CMGS=%d\r", len );
		ret = gsm_send( buf, RT_NULL, ">", RESP_TYPE_STR, RT_TICK_PER_SECOND * 5, 1 );
		if( ret == RT_EOK )
		{
			len = strlen( sms_send_str + 1 );   /*真实消息长度,包括CTRL_Z*/
			rt_kprintf("\nSMS>SEND(len=%d):%s",len,sms_send_str+1);
			m66_write( &dev_gsm, 1, sms_send_str, len );
		}
		buf[0]	= 0x1A;
		buf[1]	= 0x0;
		ret		= gsm_send( buf, RT_NULL, "+CMGS:", RESP_TYPE_STR_WITHOK, RT_TICK_PER_SECOND * 30, 1 );
		rt_free( (void*)value );
	}
	if(gsm_state == GSM_AT_SEND)
		gsm_state = oldstate;
}



/*
 拨打电话处理函数
 */
void tel_proc( void )
{
	uint32_t	value;
	uint32_t	j;
	char		*sms_send_str;
	char		buf[40];
	rt_err_t	ret;
	uint16_t	len;
	static uint32_t	sms_delay_tick = 0;

	T_GSM_STATE oldstate;

	if(rt_tick_get() < sms_delay_tick)
		return;

	sms_delay_tick	= 0;

	if( sms_state != SMS_IDLE )
	{
		return;
	}
	/*检查是否出于AT命令就绪的状态,可以进行短信操作*/
	///如果模块没有开机或者已经关机则直接退出
	if(( gsm_state < GSM_AT)||(gsm_state == GSM_POWEROFF))
	{
		return;
	}
	
	if( tel_state == 0) /*收到短信操作*/
	{
		return;
	}
	tel_state =0;
	sprintf( buf, "ATD%s;\r\n", jt808_param.id_0x0040);
	ret	= gsm_send( buf, resp_TEL, RT_NULL, RESP_TYPE_FUNC, RT_TICK_PER_SECOND*6, 1 );
	if( ret == RT_EOK )
	{
		return;
	}
}

/***********************************************************
* Function:		gsmrx_cb
* Description:	gsm收到信息的处理
* Input:			char *s     信息
    uint16_t len 长度
* Output:
* Return:
* Others:
***********************************************************/
static void gsmrx_cb_M50( char *pInfo, uint16_t size )
{
	int		i, len = size;
	uint8_t tbl[24] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 0, 0, 0, 0, 0, 0, 0xa, 0xb, 0xc, 0xd, 0xe, 0xf };
	char	c, *pmsg;
	char	*psrc = RT_NULL, *pdst = RT_NULL;
	static int32_t infolen=0, linkno=0;
	char 	temp_buf[16];

	psrc	= pInfo;
	pdst	= pInfo;
/*网络侧的信息，直接通知上层软件*/
	if( fgsm_rawdata_out )
	{
		if((infolen)&&(len == infolen))
		{
			rt_kprintf( "\n%d gsm1<", rt_tick_get( ));
			printf_hex_data(psrc, infolen);
			gprs_rx( linkno, psrc, infolen );
			return;
		}
		else
		{
			linkno	= 0;
			infolen	= 0;
			rt_kprintf( "\n%d gsm<%s", rt_tick_get( ), pInfo );
		}
		fgsm_rawdata_out--;
	}

/*判读并处理*/
	//rt_kprintf("\ngsm_rx>%s",psrc);
	if( strncmp( psrc, "+RECEIVE:", 9 ) == 0 )
	{
		/*解析出净信息,编译器会优化掉pdst*/
		i = sscanf( psrc, "+RECEIVE: %d, %d", &linkno, &infolen );
		if( i != 2 )
		{
			linkno	= 0;
			infolen	= 0;
		}
		gprs_rx_len = infolen;
		return;
	}
	

	if( sms_rx( pInfo, size ) )                 /*一个完整的处理过程?*/
	{
		return;
	}

	
	if( record_rx_M50( pInfo, size ) )               /*一个完整的处理过程?*/
	{
		return;
	}

	if( strncmp( psrc, "+PDP DEACT", 10 ) == 0 )    ///模块出现异常，需要重新复位
	{
		gsmstate( GSM_POWEROFF );
		return;
	}
	/*EG:"1, CLOSED"*/
	for(i=1;i<6;i++)								///socket 连接异常断开
	{
		sprintf(temp_buf,"%d, CLOSED",i);
		if( strncmp( psrc, temp_buf, 9 ) == 0 )
		{
			cb_socket_close( i );
			return;
		}
		sprintf(temp_buf,"%d, CLOSE OK",i);
		if( strncmp( psrc, temp_buf, 11 ) == 0 )
		{
			cb_socket_close( i );
			return;
		}
	}

	/*直接发送到Mailbox中,内部处理*/
	pmsg = rt_malloc( len + 3 );		///多分配一个字节的目的是为了保证最后一个字节是0x00
	if( pmsg != RT_NULL )
	{
		*pmsg			= len >> 8;
		*( pmsg + 1 )	= len;
		memcpy( pmsg + 2, pInfo, len );
		pmsg[len+2]		= 0;
		rt_mb_send( &mb_gsmrx, (rt_uint32_t)pmsg );
	}
	return;
}

/***********************************************************
* Function:		gsmrx_cb
* Description:	gsm收到信息的处理
* Input:			char *s     信息
    uint16_t len 长度
* Output:
* Return:
* Others:
***********************************************************/
static void gsmrx_cb_M66( char *pInfo, uint16_t size )
{
	int		i, len = size;
	uint8_t tbl[24] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 0, 0, 0, 0, 0, 0, 0xa, 0xb, 0xc, 0xd, 0xe, 0xf };
	char	c, *pmsg;
	char	*psrc = RT_NULL, *pdst = RT_NULL;
	int32_t infolen, linkno;

