icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/m66.c
/*网络侧的信息，直接通知上层软件*/
	if( fgsm_rawdata_out )
	{
		rt_kprintf( "\n%d gsm<%s", rt_tick_get( ), pInfo );
		fgsm_rawdata_out--;
	}

/*判读并处理*/
	psrc	= pInfo;
	pdst	= pInfo;
	if( strncmp( psrc, "%IPDATA:", 7 ) == 0 )
	{
		/*解析出净信息,编译器会优化掉pdst*/
		i = sscanf( psrc, "%%IPDATA:%d,%d,%s", &linkno, &infolen, pdst );
		if( i != 3 )
		{
			return;
		}
		if( ( infolen + 1 ) * 2 != strlen( pdst ) ) /*有时会长度不足*/
		{
			rt_kprintf( "\n长度不足" );
			return;
		}
		if( *pdst != '"' )
		{
			return;
		}
		psrc	= pdst;     /*指向""内容*/
		pmsg	= pdst + 1; /*指向下一个位置*/

		for( i = 0; i < infolen; i++ )
		{
			c		= tbl[*pmsg++ - '0'] << 4;
			c		|= tbl[*pmsg++ - '0'];
			*pdst++ = c;
		}
		gprs_rx( linkno, psrc, infolen );
		return;
	}
/*	00002381 gsm<%IPCLOSE:1*/

	if( strncmp( psrc, "%IPCLOSE:", 9 ) == 0 )
	{
		c = *( psrc + 9 ) - 0x30;
		cb_socket_close( c );
		return;
	}

	if( sms_rx( pInfo, size ) )                 /*一个完整的处理过程?*/
	{
		return;
	}

	/*直接发送到Mailbox中,内部处理*/
	pmsg = rt_malloc( len + 3 );		///多分配一个字节的目的是为了保证最后一个字节是0x00
	if( pmsg != RT_NULL )
	{
		*pmsg			= len >> 8;
		*( pmsg + 1 )	= len;
		memcpy( pmsg + 2, pInfo, len );
		pmsg[len+2]		= 0;
		rt_mb_send( &mb_gsmrx, (rt_uint32_t)pmsg );
	}
	return;
}

/***********************************************************
* Function:		gsmrx_cb
* Description:	gsm收到信息的处理
* Input:			char *s     信息
    uint16_t len 长度
* Output:
* Return:
* Others:
***********************************************************/
static void gsmrx_cb( char *pInfo, uint16_t size )
{
	if(modem_style == MODEM_M50)
	{
		gsmrx_cb_M50(pInfo,size);
	}
	else
	{
		gsmrx_cb_M66(pInfo,size);
	}
}

#define RT_THREAD_ENTRY_GSM

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[2048]  __attribute__((section("CCM_RT_STACK")));
struct rt_thread thread_gsm;


/*
   状态转换，同时处理开机、登网、短信、TTS、录音等过程
 */
static void rt_thread_entry_gsm( void* parameter )
{
	uint16_t tick_checksq = 0;
	
	while( 1 )
	{
		wdg_thread_counter[4]=1;

		switch( gsm_state )
		{
			case GSM_POWERON:
				rt_thread_gsm_power_on( RT_NULL );
				break;
			case GSM_POWEROFF:
				rt_thread_gsm_power_off();
				break;
			case  GSM_GPRS:
				rt_thread_gsm_gprs( RT_NULL );
				break;
			case GSM_SOCKET_PROC:
				rt_thread_gsm_socket( RT_NULL );
				break;
			case GSM_IDLE:
				break;
			case GSM_TCPIP: /*在TCPIP状态下检测sq信号*/
				tick_checksq++;
				if(tick_checksq > 600)
				{
					if(RT_EOK==gsm_send( "AT+CSQ\r\n", resp_CSQ, RT_NULL, RESP_TYPE_FUNC_WITHOK, RT_TICK_PER_SECOND * 3, 1 ))
					{
						tick_checksq = 0;
					}
				}
				break;
			case GSM_AT:
				break;
			case GSM_AT_SEND:
				break;
		}
		jt808_tx_data_proc();
		tel_proc( );
		sms_proc( );
		tts_proc( );    /*tts处理*/
		at_cmd_proc( ); /*at命令处理*/
		record_proc_M50( );
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

#define RT_THREAD_ENTRY_GSM_RX

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_rx_stack[1024]  __attribute__((section("CCM_RT_STACK")));
struct rt_thread thread_gsm_rx;


/*
   状态转换，同时处理短信、TTS、录音等过程
 */
static void rt_thread_entry_gsm_rx( void* parameter )
{
	unsigned char ch;
	int rx_command;
	while( 1 )
	{
		rx_command = 1;
		while( uart4_rxbuf_rd != uart4_rxbuf_wr )   /*有数据时，保存数据*/
		{
			ch				= uart4_rxbuf[uart4_rxbuf_rd++];
			uart4_rxbuf_rd	%= UART4_RX_SIZE;
			
			if(gprs_rx_len)
			{
				if((0 == gsm_rx_wr)&&(0x0A == ch)&& rx_command)
				{
					rx_command =0;
					continue;
				}
				--gprs_rx_len;
				gsm_rx[gsm_rx_wr++] = ch;
				gsm_rx_wr			%= GSM_RX_SIZE;
				gsm_rx[gsm_rx_wr]	= 0;
				if(0==gprs_rx_len)
				{
					gsmrx_cb( (char*)gsm_rx, gsm_rx_wr );           /*接收信息的处理函数*/
					gsm_rx_wr = 0;
				}
				continue;
			}
			else if( ch > 0x1F )                         /*可见字符才保存*/
			{
				gsm_rx[gsm_rx_wr++] = ch;
				gsm_rx_wr			%= GSM_RX_SIZE;
				gsm_rx[gsm_rx_wr]	= 0;
			}
			if( ch == 0x0d )
			{
				if( gsm_rx_wr )
				{
					gsmrx_cb( (char*)gsm_rx, gsm_rx_wr );           /*接收信息的处理函数*/
				}
				gsm_rx_wr = 0;
			}
			rx_command = 1;
		}
		if( rt_tick_get( ) - last_tick > RT_TICK_PER_SECOND / 5 )   //等待200ms,实际上就是变长的延时,最迟100ms处理完一个数据包
		{
			if( gsm_rx_wr )
			{
				gsmrx_cb( (char*)gsm_rx, gsm_rx_wr );               /*接收信息的处理函数*/
				gsm_rx_wr = 0;
			}
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( void )
{
	rt_sem_init( &sem_at, "sem_at", 1, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_gsmrx, "mb_gsmrx", &mb_gsmrx_pool, MB_GSMRX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_tts, "mb_tts", &mb_tts_pool, MB_TTS_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_at_tx, "mb_at_tx", &mb_at_tx_pool, MB_AT_TX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_sms, "mb_sms_rx", &mb_sms_pool, MB_SMS_RX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );

	rt_thread_init( &thread_gsm_rx,
	                "gsm_rx",
	                rt_thread_entry_gsm_rx,
	                RT_NULL,
	                &thread_gsm_rx_stack[0],
	                sizeof( thread_gsm_rx_stack ), 6, 5 );
	rt_thread_startup( &thread_gsm_rx );

	dev_gsm.type	= RT_Device_Class_Char;
	dev_gsm.init	= m66_init;
	dev_gsm.open	= m66_open;
	dev_gsm.close	= m66_close;
	dev_gsm.read	= m66_read;
	dev_gsm.write	= m66_write;
	dev_gsm.control = m66_control;

	rt_device_register( &dev_gsm, "gsm", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_gsm );
}

/************************************** The End Of File **************************************/
